{
    "document-title": "Responsive Portfolio | Andrey Jodar",
    "home-header": "Home" ,
    "projects-header": "Projects",
    "skills-header": "Skills",
    "education-header": "Education",
    "contact-header": "Contact",
    "home-title": "Hi, I'm <span class='bold'>Andrey Jodar</span>",
    "home-subtitle": "I'm a <span class='bold'>Software Engineering</span> Student",
    "home-text": "As an enthusiastic student of software life cycle and agile processes, I believe that systems are more about user experience and connection than just technological solutions. If you are looking for a developer who thinks this way, appreciates fields like Software Architecture, Design Patterns, Open Source tecnologies and is eager to learn new skills, then you have come to the right place. Feel free to contact me if our aspirations align.",
    "proj-title": "My <span class='bold'>Projects</span>",
    "proj-subtitle1": "Bank Layered Backend",
    "proj-text1": "During my Object-Oriented Programming classes, I developed a hypothetical layered backend using Design Patterns such as MVC(Model-View-Controller) and DAO(Data Access Object). In this project I learned to use the Eclipe IDE, Maven dependency manager, Hibernate fremework with JPA and Apache servers using XAMPP.",
    "proj-subtitle2": "Data Structure Lib",
    "proj-text2": "As a stand-alone design project, inspired by my Algorithms and Data Structures classes, I am developing a Data Structure Library to improve my skills. singly-linked lists, doubly-linked lists and circular-linked lists are examples of data structures that I am working on in this personal project.",
    "proj-subtitle3": "Memory Hierarchy Simulator",
    "proj-text3": "During my Computer Architecture classes, I developed a memory hierarchy simulator using concepts such as Polymorphism, Inheritance and Encapsulation (OOP) to emulate architectural structures like cache memory and primary memory defining their interactions. In this way, the system counts and displays memory accesses (misses and hits).",
    "skill-title": "My <span class='bold'>Skills</span>",
    "education-title": "My <span class='bold'>Education</span>",
    "education-subtitle1": "High School",
    "education-text1": "I studied as a scholarship student throughout high school. In my first year, I studied at Dom Bosco High School, in Maringá, Paraná, Brazil. In my second and third years, I studied at Paroquial High School, in Paranavaí, Paraná, Brazil.",
    "education-subtitle2": "College",
    "education-text2": "I have been studying a Bachelor's degree in Software Engineering at the Federal Instutute of Parana (IFPR) since I was admitted in 2023. The program lasts four years, and I am expected to graduate in 2026.",
    "contact-title": "<span class='bold'>Contact</span> Me",
    "form-name": "Name",
    "form-subject": "Subject",
    "form-message": "Message",
    "form-submit": "Send Message",
    "rights-text": "© Andrey Jodar | All Rights Reserved",
    "popup-text": "Message sent successfully!"
}