{
    "document-title": "Portifólio Responsivo | Andrey Jodar",
    "home-header": "Sobre",
    "projects-header": "Projetos",
    "skills-header": "Habilidades",
    "education-header": "Formação",
    "contact-header": "Contato",
    "home-title": "Olá, me chamo <span class='bold'>Andrey Jodar</span>",
    "home-subtitle": "Sou um Estudante de <span class='bold'>Engenharia de Software</span>",
    "home-text": "Como um estudante entusiasta do ciclo de vida de software e de processos ágeis, acredito que os sistemas têm mais a ver com experiência e conexão do usuário do que apenas com soluções tecnológicas. Se você está procurando um desenvolvedor que pensa dessa forma, aprecia áreas como Arquitetura de Software, Padrões de Projeto, comunidades de Código Aberto e está ansioso para aprender novas habilidades, então você veio ao lugar certo. Sinta-se à vontade para entrar em contato comigo se nossas aspirações estiverem alinhadas.",
    "proj-title": "Meus <span class='bold'>Projetos</span>",
    "proj-subtitle1": "Back-end em Camadas para um Banco",
    "proj-text1": "Durante minhas aulas de Programação Orientada a Objetos, desenvolvi um back-end hipotético em camadas usando Padrões de Projeto como MVC (Model-View-Controller) e DAO (Data Access Object). Neste projeto aprendi a utilizar a IDE Eclipe, o gerenciador de dependências Maven, o fremework Hibernate com JPA e os servidores Apache utilizando XAMPP.",
    "proj-subtitle2": "Biblioteca de Estruturas de Dados",
    "proj-text2": "Como um projeto independente, inspirado em minhas aulas de Algoritmos e Estruturas de Dados, estou desenvolvendo uma Biblioteca de Estruturas de Dados para melhorar minhas habilidades. listas simplesmente encadeadas, listas duplamente encadeadas e listas circularmente encadeadas são exemplos de estruturas de dados nas quais estou trabalhando neste projeto pessoal.",
    "proj-subtitle3": "Simulador de Hierarquia de Memória",
    "proj-text3": "Durante minhas aulas de Arquitetura de Computadores, desenvolvi um simulador de hierarquia de memória usando conceitos como Polimorfismo, Herança e Encapsulamento (OOP) para emular estruturas arquitetônicas como memória cache e memória primária definindo suas interações. Dessa forma, o sistema conta e exibe os acessos à memória (erros e acertos).",
    "skill-title": "Minhas <span class='bold'>Habilidades</span>",
    "education-title": "Minha <span class='bold'>Formação</span>",
    "education-subtitle1": "Ensino Médio",
    "education-text1": "Estudei como bolsista durante todo o ensino médio. No meu primeiro ano, estudei no Colégio Dom Bosco, em Maringá, Paraná, Brasil. Durante o segunto e o terceiro ano estudei no Colégio Paroquial, em Paranavaí, Paraná, Brasil.",
    "education-subtitle2": "Ensino Superior",
    "education-text2": "Estou cursando bacharelado em Engenharia de Software no Instituto Federal do Paraná (IFPR) desde que fui admitido em 2023. O programa tem duração de quatro anos e tenho previsão de me formar em 2026.",
    "contact-title": "Entre em <span class='bold'>Contato</span>",
    "form-name": "Nome",
    "form-subject": "Assunto",
    "form-message": "Mensagem",
    "form-submit": "Enviar Mensagem",
    "rights-text": "© Andrey Jodar | Todos os Direitos Reservados",
    "popup-text": "Mensagem enviada com sucesso!"
}